UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g484_dma.h
/* Do not edit! Generated automatically from /devel/cubemx/db/mcu/IP/DMA-STM32G484_dma1_v1_3_Modes.xml.*/

#if !defined(_STM32G484_DMA_H_)
# define _STM32G484_DMA_H_

#define STM32_DMA_VERSION 13

#define DMA_ADC1           {{DMA_ANY, DMA_REQUEST_ADC1}, {}}
#define DMA_ADC2           {{DMA_ANY, DMA_REQUEST_ADC2}, {}}
#define DMA_ADC3           {{DMA_ANY, DMA_REQUEST_ADC3}, {}}
#define DMA_ADC4           {{DMA_ANY, DMA_REQUEST_ADC4}, {}}
#define DMA_ADC5           {{DMA_ANY, DMA_REQUEST_ADC5}, {}}
#define DMA_AES_IN         {{DMA_ANY, DMA_REQUEST_AES_IN}, {}}
#define DMA_AES_OUT        {{DMA_ANY, DMA_REQUEST_AES_OUT}, {}}
#define DMA_CORDIC_READ    {{DMA_ANY, DMA_REQUEST_CORDIC_READ}, {}}
#define DMA_CORDIC_WRITE   {{DMA_ANY, DMA_REQUEST_CORDIC_WRITE}, {}}
#define DMA_DAC1_CH1       {{DMA_ANY, DMA_REQUEST_DAC1_CH1}, {}}
#define DMA_DAC1_CH2       {{DMA_ANY, DMA_REQUEST_DAC1_CH2}, {}}
#define DMA_DAC2_CH1       {{DMA_ANY, DMA_REQUEST_DAC2_CH1}, {}}
#define DMA_DAC3_CH1       {{DMA_ANY, DMA_REQUEST_DAC3_CH1}, {}}
#define DMA_DAC3_CH2       {{DMA_ANY, DMA_REQUEST_DAC3_CH2}, {}}
#define DMA_DAC4_CH1       {{DMA_ANY, DMA_REQUEST_DAC4_CH1}, {}}
#define DMA_DAC4_CH2       {{DMA_ANY, DMA_REQUEST_DAC4_CH2}, {}}
#define DMA_DMA_GENERATOR0 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR0}, {}}
#define DMA_DMA_GENERATOR1 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR1}, {}}
#define DMA_DMA_GENERATOR2 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR2}, {}}
#define DMA_DMA_GENERATOR3 {{DMA_ANY, DMA_REQUEST_DMA_GENERATOR3}, {}}
#define DMA_FMAC_PRELOAD   {{DMA_ANY, DMA_REQUEST_FMAC_PRELOAD}, {}}
#define DMA_FMAC_READ      {{DMA_ANY, DMA_REQUEST_FMAC_READ}, {}}
#define DMA_FMAC_WRITE     {{DMA_ANY, DMA_REQUEST_FMAC_WRITE}, {}}
#define DMA_HRTIM1_A       {{DMA_ANY, DMA_REQUEST_HRTIM1_A}, {}}
#define DMA_HRTIM1_B       {{DMA_ANY, DMA_REQUEST_HRTIM1_B}, {}}
#define DMA_HRTIM1_C       {{DMA_ANY, DMA_REQUEST_HRTIM1_C}, {}}
#define DMA_HRTIM1_D       {{DMA_ANY, DMA_REQUEST_HRTIM1_D}, {}}
#define DMA_HRTIM1_E       {{DMA_ANY, DMA_REQUEST_HRTIM1_E}, {}}
#define DMA_HRTIM1_F       {{DMA_ANY, DMA_REQUEST_HRTIM1_F}, {}}
#define DMA_HRTIM1_M       {{DMA_ANY, DMA_REQUEST_HRTIM1_M}, {}}
#define DMA_I2C1_RX        {{DMA_ANY, DMA_REQUEST_I2C1_RX}, {}}
#define DMA_I2C1_TX        {{DMA_ANY, DMA_REQUEST_I2C1_TX}, {}}
#define DMA_I2C2_RX        {{DMA_ANY, DMA_REQUEST_I2C2_RX}, {}}
#define DMA_I2C2_TX        {{DMA_ANY, DMA_REQUEST_I2C2_TX}, {}}
#define DMA_I2C3_RX        {{DMA_ANY, DMA_REQUEST_I2C3_RX}, {}}
#define DMA_I2C3_TX        {{DMA_ANY, DMA_REQUEST_I2C3_TX}, {}}
#define DMA_I2C4_RX        {{DMA_ANY, DMA_REQUEST_I2C4_RX}, {}}
#define DMA_I2C4_TX        {{DMA_ANY, DMA_REQUEST_I2C4_TX}, {}}
#define DMA_LPUART1_RX     {{DMA_ANY, DMA_REQUEST_LPUART1_RX}, {}}
#define DMA_LPUART1_TX     {{DMA_ANY, DMA_REQUEST_LPUART1_TX}, {}}
#define DMA_QUADSPI        {{DMA_ANY, DMA_REQUEST_QUADSPI}, {}}
#define DMA_SAI1_A         {{DMA_ANY, DMA_REQUEST_SAI1_A}, {}}
#define DMA_SAI1_B         {{DMA_ANY, DMA_REQUEST_SAI1_B}, {}}
#define DMA_SPI1_RX        {{DMA_ANY, DMA_REQUEST_SPI1_RX}, {}}
#define DMA_SPI1_TX        {{DMA_ANY, DMA_REQUEST_SPI1_TX}, {}}
#define DMA_SPI2_RX        {{DMA_ANY, DMA_REQUEST_SPI2_RX}, {}}
#define DMA_SPI2_TX        {{DMA_ANY, DMA_REQUEST_SPI2_TX}, {}}
#define DMA_SPI3_RX        {{DMA_ANY, DMA_REQUEST_SPI3_RX}, {}}
#define DMA_SPI3_TX        {{DMA_ANY, DMA_REQUEST_SPI3_TX}, {}}
#define DMA_SPI4_RX        {{DMA_ANY, DMA_REQUEST_SPI4_RX}, {}}
#define DMA_SPI4_TX        {{DMA_ANY, DMA_REQUEST_SPI4_TX}, {}}
#define DMA_TIM15_CH1      {{DMA_ANY, DMA_REQUEST_TIM15_CH1}, {}}
#define DMA_TIM15_COM      {{DMA_ANY, DMA_REQUEST_TIM15_COM}, {}}
#define DMA_TIM15_TRIG     {{DMA_ANY, DMA_REQUEST_TIM15_TRIG}, {}}
#define DMA_TIM15_UP       {{DMA_ANY, DMA_REQUEST_TIM15_UP}, {}}
#define DMA_TIM16_CH1      {{DMA_ANY, DMA_REQUEST_TIM16_CH1}, {}}
#define DMA_TIM16_UP       {{DMA_ANY, DMA_REQUEST_TIM16_UP}, {}}
#define DMA_TIM17_CH1      {{DMA_ANY, DMA_REQUEST_TIM17_CH1}, {}}
#define DMA_TIM17_UP       {{DMA_ANY, DMA_REQUEST_TIM17_UP}, {}}
#define DMA_TIM1_CH1       {{DMA_ANY, DMA_REQUEST_TIM1_CH1}, {}}
#define DMA_TIM1_CH2       {{DMA_ANY, DMA_REQUEST_TIM1_CH2}, {}}
#define DMA_TIM1_CH3       {{DMA_ANY, DMA_REQUEST_TIM1_CH3}, {}}
#define DMA_TIM1_CH4       {{DMA_ANY, DMA_REQUEST_TIM1_CH4}, {}}
#define DMA_TIM1_COM       {{DMA_ANY, DMA_REQUEST_TIM1_COM}, {}}
#define DMA_TIM1_TRIG      {{DMA_ANY, DMA_REQUEST_TIM1_TRIG}, {}}
#define DMA_TIM1_UP        {{DMA_ANY, DMA_REQUEST_TIM1_UP}, {}}
#define DMA_TIM20_CH1      {{DMA_ANY, DMA_REQUEST_TIM20_CH1}, {}}
#define DMA_TIM20_CH2      {{DMA_ANY, DMA_REQUEST_TIM20_CH2}, {}}
#define DMA_TIM20_CH3      {{DMA_ANY, DMA_REQUEST_TIM20_CH3}, {}}
#define DMA_TIM20_CH4      {{DMA_ANY, DMA_REQUEST_TIM20_CH4}, {}}
#define DMA_TIM20_COM      {{DMA_ANY, DMA_REQUEST_TIM20_COM}, {}}
#define DMA_TIM20_TRIG     {{DMA_ANY, DMA_REQUEST_TIM20_TRIG}, {}}
#define DMA_TIM20_UP       {{DMA_ANY, DMA_REQUEST_TIM20_UP}, {}}
#define DMA_TIM2_CH1       {{DMA_ANY, DMA_REQUEST_TIM2_CH1}, {}}
#define DMA_TIM2_CH2       {{DMA_ANY, DMA_REQUEST_TIM2_CH2}, {}}
#define DMA_TIM2_CH3       {{DMA_ANY, DMA_REQUEST_TIM2_CH3}, {}}
#define DMA_TIM2_CH4       {{DMA_ANY, DMA_REQUEST_TIM2_CH4}, {}}
#define DMA_TIM2_UP        {{DMA_ANY, DMA_REQUEST_TIM2_UP}, {}}
#define DMA_TIM3_CH1       {{DMA_ANY, DMA_REQUEST_TIM3_CH1}, {}}
#define DMA_TIM3_CH2       {{DMA_ANY, DMA_REQUEST_TIM3_CH2}, {}}
#define DMA_TIM3_CH3       {{DMA_ANY, DMA_REQUEST_TIM3_CH3}, {}}
#define DMA_TIM3_CH4       {{DMA_ANY, DMA_REQUEST_TIM3_CH4}, {}}
#define DMA_TIM3_TRIG      {{DMA_ANY, DMA_REQUEST_TIM3_TRIG}, {}}
#define DMA_TIM3_UP        {{DMA_ANY, DMA_REQUEST_TIM3_UP}, {}}
#define DMA_TIM4_CH1       {{DMA_ANY, DMA_REQUEST_TIM4_CH1}, {}}
#define DMA_TIM4_CH2       {{DMA_ANY, DMA_REQUEST_TIM4_CH2}, {}}
#define DMA_TIM4_CH3       {{DMA_ANY, DMA_REQUEST_TIM4_CH3}, {}}
#define DMA_TIM4_CH4       {{DMA_ANY, DMA_REQUEST_TIM4_CH4}, {}}
#define DMA_TIM4_UP        {{DMA_ANY, DMA_REQUEST_TIM4_UP}, {}}
#define DMA_TIM5_CH1       {{DMA_ANY, DMA_REQUEST_TIM5_CH1}, {}}
#define DMA_TIM5_CH2       {{DMA_ANY, DMA_REQUEST_TIM5_CH2}, {}}
#define DMA_TIM5_CH3       {{DMA_ANY, DMA_REQUEST_TIM5_CH3}, {}}
#define DMA_TIM5_CH4       {{DMA_ANY, DMA_REQUEST_TIM5_CH4}, {}}
#define DMA_TIM5_TRIG      {{DMA_ANY, DMA_REQUEST_TIM5_TRIG}, {}}
#define DMA_TIM5_UP        {{DMA_ANY, DMA_REQUEST_TIM5_UP}, {}}
#define DMA_TIM6_UP        {{DMA_ANY, DMA_REQUEST_TIM6_UP}, {}}
#define DMA_TIM7_UP        {{DMA_ANY, DMA_REQUEST_TIM7_UP}, {}}
#define DMA_TIM8_CH1       {{DMA_ANY, DMA_REQUEST_TIM8_CH1}, {}}
#define DMA_TIM8_CH2       {{DMA_ANY, DMA_REQUEST_TIM8_CH2}, {}}
#define DMA_TIM8_CH3       {{DMA_ANY, DMA_REQUEST_TIM8_CH3}, {}}
#define DMA_TIM8_CH4       {{DMA_ANY, DMA_REQUEST_TIM8_CH4}, {}}
#define DMA_TIM8_COM       {{DMA_ANY, DMA_REQUEST_TIM8_COM}, {}}
#define DMA_TIM8_TRIG      {{DMA_ANY, DMA_REQUEST_TIM8_TRIG}, {}}
#define DMA_TIM8_UP        {{DMA_ANY, DMA_REQUEST_TIM8_UP}, {}}
#define DMA_UART4_RX       {{DMA_ANY, DMA_REQUEST_UART4_RX}, {}}
#define DMA_UART4_TX       {{DMA_ANY, DMA_REQUEST_UART4_TX}, {}}
#define DMA_UART5_RX       {{DMA_ANY, DMA_REQUEST_UART5_RX}, {}}
#define DMA_UART5_TX       {{DMA_ANY, DMA_REQUEST_UART5_TX}, {}}
#define DMA_UCPD1_RX       {{DMA_ANY, DMA_REQUEST_UCPD1_RX}, {}}
#define DMA_UCPD1_TX       {{DMA_ANY, DMA_REQUEST_UCPD1_TX}, {}}
#define DMA_USART1_RX      {{DMA_ANY, DMA_REQUEST_USART1_RX}, {}}
#define DMA_UART1_RX    DMA_USART1_RX
#define DMA_USART1_TX      {{DMA_ANY, DMA_REQUEST_USART1_TX}, {}}
#define DMA_UART1_TX    DMA_USART1_TX
#define DMA_USART2_RX      {{DMA_ANY, DMA_REQUEST_USART2_RX}, {}}
#define DMA_UART2_RX    DMA_USART2_RX
#define DMA_USART2_TX      {{DMA_ANY, DMA_REQUEST_USART2_TX}, {}}
#define DMA_UART2_TX    DMA_USART2_TX
#define DMA_USART3_RX      {{DMA_ANY, DMA_REQUEST_USART3_RX}, {}}
#define DMA_UART3_RX    DMA_USART3_RX
#define DMA_USART3_TX      {{DMA_ANY, DMA_REQUEST_USART3_TX}}
#define DMA_UART3_TX    DMA_USART3_TX

#endif
